In [4]:
import pandas as pd
import numpy as np

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1.0, 1.5])
data

0    0.25
1    0.50
2    0.75
3    1.00
4    1.50
dtype: float64

In [9]:
data.values

array([0.25, 0.5 , 0.75, 1.  , 1.5 ])

In [10]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
data[2:4]

2    0.75
3    1.00
dtype: float64

In [18]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [19]:
data['c']

0.75

In [20]:
data = pd.Series([1, 2, 3], index=['qwe', '1', '<'])
data

qwe    1
1      2
<      3
dtype: int64

In [27]:
pop_dict = {'california':333333,
           'Texas':666666,
           'New_york':444444,
           'Florida':2222222,
           'Illinois':55555555}
pop = pd.Series(pop_dict)
pop

california      333333
Texas           666666
New_york        444444
Florida        2222222
Illinois      55555555
dtype: int64

In [22]:
pop['Florida']

2222222

In [24]:
pop['california':'New_york']

california    333333
Texas         666666
New_york      444444
dtype: int64

In [28]:
s = pd.Series(5, index=[100, 200, 300, 400, 500])
s

100    5
200    5
300    5
400    5
500    5
dtype: int64

In [29]:
d = pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])
d

3    c
2    a
dtype: object

In [40]:

new_dict = {'california':2345,
           'Texas':4584,
           'New_york':3294,
           'Florida':9328,
           'Illinois':6553,
           'sdg':3412234}
pup = pd.Series(new_dict)

In [41]:
states = pd.DataFrame({'Population':pop, 
                      'Area':pup})
states

            Population     Area
Florida      2222222.0     9328
Illinois    55555555.0     6553
New_york      444444.0     3294
Texas         666666.0     4584
california    333333.0     2345
sdg                NaN  3412234

In [42]:
states.index

Index(['Florida', 'Illinois', 'New_york', 'Texas', 'california', 'sdg'], dtype='object')

In [43]:
states.columns

Index(['Population', 'Area'], dtype='object')

In [60]:
data = pd.Series([1, 2, 3, 4, 5])

In [63]:
dt = pd.DataFrame(data, columns=['screan'])

In [64]:
dt

   screan
0       1
1       2
2       3
3       4
4       5

In [68]:
data_dict=[{'a':i, 'b':i*2} for i in range(5)]#'a' и 'b' это столбцы
q = pd.Series(data_dict)
q

0    {'a': 0, 'b': 0}
1    {'a': 1, 'b': 2}
2    {'a': 2, 'b': 4}
3    {'a': 3, 'b': 6}
4    {'a': 4, 'b': 8}
dtype: object

In [67]:
dt = pd.DataFrame(data_dict)
dt

   a  b
0  0  0
1  1  2
2  2  4
3  3  6
4  4  8

In [69]:
dt = pd.DataFrame({'population':pop, 
                  'area':pup})
dt

            population     area
Florida      2222222.0     9328
Illinois    55555555.0     6553
New_york      444444.0     3294
Texas         666666.0     4584
california    333333.0     2345
sdg                NaN  3412234

In [72]:
pd.DataFrame(np.random.rand(3, 2), columns=['col1', 'col2'], index=['a', 'b', 'c'])

       col1      col2
a  0.297838  0.983183
b  0.448355  0.702216
c  0.272351  0.433723

In [88]:
x = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
pd.DataFrame(x, index=[',', '<', '='])

   A    B
,  0  0.0
<  0  0.0
=  0  0.0

     0    1
0  0.0  0.0
1  0.0  0.0
2  0.0  0.0

In [8]:
import pandas as pd
import numpy as np

ind = pd.Index([1, 2, 3, 4, 6, 6])
ind

Int64Index([1, 2, 3, 4, 6, 6], dtype='int64')

In [9]:
num = np.random.rand(6, 2)
data = pd.DataFrame(num, columns=['Колонка 1', 'Колонка 2'], index=ind)
data

   Колонка 1  Колонка 2
1   0.726206   0.503825
2   0.386369   0.064437
3   0.172193   0.724717
4   0.190626   0.203148
6   0.712475   0.789611
6   0.370863   0.810601

In [14]:
ind[::-1]

Int64Index([6, 6, 4, 3, 2, 1], dtype='int64')

In [19]:
ind[0] = 100

TypeError: Index does not support mutable operations

In [20]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7 ,11])
indA & indB

C:\Users\user\AppData\Local\Temp/ipykernel_10288/2039934808.py:3: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [21]:
indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [22]:
indA | indB

C:\Users\user\AppData\Local\Temp/ipykernel_10288/3251124211.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [25]:
indA ^ indB

C:\Users\user\AppData\Local\Temp/ipykernel_10288/2832893868.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')